# Exploring a DataFrame

## Setup

In [1]:
import numpy as np
import pandas as pd

pd.set_option('display.max_columns', 10)
pd.set_option('display.max_rows', 10)

#### Create a DataFrame from the first seven columns of mantle.csv.

In [2]:
csv ='../csvs/mantle.csv'
mantle = pd.read_csv(csv, usecols=range(7))

#### Explore the DataFrame.
Get the column names, index, and the number of rows and columns.

In [3]:
mantle.columns

Index(['Year', 'Tm', 'G', 'PA', 'AB', 'R', 'H'], dtype='object')

In [4]:
mantle.index

RangeIndex(start=0, stop=18, step=1)

In [5]:
mantle.shape

(18, 7)

#### Get quick information (e.g., counts, means, mins and maxes) on the data.

In [6]:
mantle.describe()

              Year           G          PA          AB           R           H
count    18.000000   18.000000   18.000000   18.000000   18.000000   18.000000
mean   1959.500000  133.388889  550.388889  450.111111   93.111111  134.166667
std       5.338539   23.364475  122.925678  100.072261   33.585517   36.361340
min    1951.000000   65.000000  213.000000  172.000000   40.000000   54.000000
25%    1955.250000  124.000000  511.500000  391.500000   61.500000  104.250000
50%    1959.500000  144.000000  595.000000  469.500000  100.000000  143.000000
75%    1963.750000  146.750000  642.250000  525.000000  121.000000  161.750000
max    1968.000000  153.000000  654.000000  549.000000  132.000000  188.000000

#### Get the first three rows of data.

In [7]:
mantle.head(3)

   Year   Tm    G   PA   AB    R    H
0  1951  NYY   96  386  341   61   91
1  1952  NYY  142  626  549   94  171
2  1953  NYY  127  540  461  105  136

#### Get the last three rows of data.

In [8]:
mantle.tail(3)

    Year   Tm    G   PA   AB   R    H
15  1966  NYY  108  393  333  40   96
16  1967  NYY  144  553  440  63  108
17  1968  NYY  144  547  435  57  103

#### Get just the AB and H columns.

In [9]:
mantle[['AB', 'H']]

     AB    H
0   341   91
1   549  171
2   461  136
3   543  163
4   517  158
..  ...  ...
13  465  141
14  361   92
15  333   96
16  440  108
17  435  103

[18 rows x 2 columns]